import type { IReview } from '@widgets/Gallery';

export const reviews: IReview[] = [
	{
		name: 'Дмитро Терен',
		review: 'Оформлення кредиту зайняло лише 5 хвилин! Дуже зручно, гроші одразу надійшли на карту, рекомендую всім!',
	},
	{
		name: 'Тетяна Онопко',
		review: 'Дуже вдячна за простоту і турботу! Звернулася вперше й отримав необхідну суму за лічені хвилини.',
	},
	{
		name: 'Олександр Іваненко',
		review: 'Супер зручно і швидко! Без зайвих документів і питань. Виручили мене вже не перший раз! Дуже вдячний! ',
	},
	{
		name: 'Ігор Орлов',
		review: 'Дуже зручно і швидко! Допомогли вирішити фінансові труднощі, коли це було потрібно найбільше.',
	},
	{
		name: 'Марія Соловей',
		review: 'Оформила кредит прямо з телефону! Зрозумілий інтерфейс, гроші отримала за декілька хвилин. Рекомендую!',
	},
	{
		name: 'Сергій Коваленко',
		review: 'Чудовий сервіс! Відмінна підтримка клієнтів і жодних прихованих умов. Оформлення просте й швидке!',
	},
	{
		name: 'Олена Журавська',
		review: 'Потрібні були гроші терміново, і я не помилилася з вибором. Все швидко, прозоро й дуже зручно!',
	},
	{
		name: 'Андрій Поліщук',
		review: 'Це найзручніший сервіс, який я коли-небудь використовував! Мені сподобалася швидкість і простота оформлення.',
	},
	{
		name: 'Катерина Мельник',
		review: 'Справді професійний сервіс! Рятували мене в складних ситуаціях вже кілька разів. Щиро вдячна!',
	},
];