import type { IMainGeneralConditions } from '../types/MainGeneralConditions.types';

export const conditions: IMainGeneralConditions[] = [
	{
		text: (
			<>
				Creditberry – це онлайн-сервіс, який допомагає підбирати вигідні кредитні пропозиції від надійних фінансових партнерів. Ми надаємо список доступних варіантів, щоб ви могли швидко та зручно обрати найкращу пропозицію для себе.
				<br/><br/>
				Creditberry не є банком чи кредитною організацією, не видає позики та не несе відповідальності за умови кредитування. Деякі партнери можуть пропонувати кредити з мінімальною ставкою від 0,01%. Щоб отримати список доступних пропозицій, достатньо заповнити коротку анкету на сайті.
				<br/><br/>
				Використовуючи сервіс, ви даєте згоду на обробку персональних даних та отримання рекламних матеріалів. Creditberry використовує файли cookie для покращення роботи сайту – ви можете змінити налаштування cookie у своєму браузері. Сервіс доступний для користувачів віком від 18 років. Усі розрахунки у калькуляторі на сайті є орієнтовними та базуються на середніх показниках ставок наших фінансових партнерів.
			</>
		),
	},
	{
		title: 'Строк погашення та процентні ставки',
		list: [
			'– мінімальний термін погашення боргу (minimum period for repayment) - 90 днів;',
			'– максимальний термін (maximum period for repayment) - 365 днів;',
			'– максимальна річна відсоткова ставка, що включає відсоток, а також всі інші комісії та витрати за рік (maximum Annual Percentage Rate (APR), including interest rate plus fees and other costs for year) становить 182,5%;',
			'- комісія за користування кредитом - відсутня;',
			'– річний процент за користування кредитом - min 36,5%, max 182,5%.',
		],
	},
	{
		title: 'Приклад розрахунку та вартості кредитів (реpresentative example of the total cost of the loan, including all applicable fees) в умовах пільгового періоду',
		list: [
			'Сума – 1000 грн.',
			'Термін – 90 днів.',
			'Процентна ставка - 0,01% на день.',
			'Плата за користування коштами становитиме 0,01% на день – 0,1 грн.',
			'Сума до повернення – 9 грн (тобто 0,1 грн * 90 днів) та тіло кредиту.',
			'Загальна сума до повернення через 90 днів – 1009 грн.',
			'APR = 36,5%.',
		],
	},
];